Config/Enums/БазыРаспределенияКосвенныхЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>БазыРаспределенияКосвенныхЗатрат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаТруда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МатериальныеЗатраты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрямыеЗатраты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выручка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РучноеРаспределение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрируетсяВручную</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/БазыРаспределенияКосвенныхЗатрат/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	// Значение перечисления "Ручное распределение" не выбирается пользователем интерактивно,
	// а устанавливается автоматически при ручной корректировке результатов распределения.
	ДанныеВыбора = Новый СписокЗначений();
	ДанныеВыбора.Добавить(Перечисления.БазыРаспределенияКосвенныхЗатрат.ПрямыеЗатраты);
	ДанныеВыбора.Добавить(Перечисления.БазыРаспределенияКосвенныхЗатрат.МатериальныеЗатраты);
	ДанныеВыбора.Добавить(Перечисления.БазыРаспределенияКосвенныхЗатрат.ОплатаТруда);
	ДанныеВыбора.Добавить(Перечисления.БазыРаспределенияКосвенныхЗатрат.Выручка);
	ДанныеВыбора.Добавить(Перечисления.БазыРаспределенияКосвенныхЗатрат.РегистрируетсяВручную);
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
